
export default {
  name: 'وصف نقابة الزرف',
  command: ['وصف'],
  category: 'أدوات',
  description: 'يعرض وصفًا شاملاً حول نقابة الزرف.',
  args: [],
  execution: async ({ sock, m }) => {
    const description = `*✥━━━✥• ☯︎ ~┋❮👑❯┋~ ☯︎ •✥━━━✥*
 *نقابة الزرف* هي نقابة متخصصة في فنون الزرف والإشراف على المجموعات. تهدف النقابة إلى جمع الأفراد المبدعين وتوجيههم في كيفية إدارة المجموعات والسيطرة عليها بأفضل الطرق الممكنة.

👑  *الهدف الأساسي للنقابة*:
- تحسين أساليب التحكم والإدارة في المجموعات.
- تعليم أعضائها كيفية استخدام الصلاحيات والتعامل مع المجموعات بشكل استراتيجي.
- الحفاظ على الانضباط والتنظيم داخل المجموعات.

⚖️  *قوانين النقابة*:
- احترام الجميع والتعامل معهم بلباقة.
- تجنب التصرفات العشوائية وضرورة التفكير في كل خطوة.
- الحفاظ على السرية التامة داخل النقابة.

🌟  *مميزات الانضمام إلى النقابة*:
- الحصول على صلاحيات خاصة لإدارة المجموعات.
- فرصة للتعلم من الخبراء وتبادل الخبرات.
- القدرة على اتخاذ قرارات قوية في إدارة المجموعات.

🔑  *كيفية الانضمام* :
يجب على كل عضو الالتزام بقوانين النقابة وحضور الدورات التدريبية.

للانضمام إلى نقابة الزرف أو للحصول على المزيد من المعلومات، يمكنك التواصل مع أي من الأعضاء المشرفين.
  *✥━━━✥• ☯︎ ~┋❮👑❯┋~ ☯︎ •✥━━━✥*  `;

    // إرسال الوصف
    await sock.sendMessage(m.key.remoteJid, { text: description });
  },
};